fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32.h
    5. Display Backlight Brightness Control - this controls the backlight
            brightness or ON or OFF states if available. If brightness is
            controllable, this signal may be driven by some PWM signal.

            Example:
            #define DisplayBacklightConfig()    TRISDbits.TRISD0 = 0
            #define DisplayBacklightOn()        LATDbits.LATD0 = 0
            #define DisplayBacklightOff()       LATDbits.LATD0 = 1

*/

// -----------------------------------
// When using GFX_PICTAIL_V3, GFX_PICTAIL_V3E, GFX_PICTAIL_LCC
// -----------------------------------
/*
    This development board will be compatible with:
    1. Explorer 16 (EXPLORER_16)
    2. PIC32 Starter Kits
       - PIC32 Starter Kit (DM320001)
       - PIC32 USB Starter Kit II (DM320003-2)
       - PIC32 Ethernet Starter Kit (DM320004)
*/

    // Depending on the display panel used, the backlight control may be
    // different. This portion sets up the correct backlight level to
    // turn on or off the backlight.
    #if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
        #define BACKLIGHT_ENABLE_LEVEL      0
        #define BACKLIGHT_DISABLE_LEVEL     1
    #elif defined (GFX_USE_DISPLAY_PANEL_PH480272T_005_I11Q)
        #define BACKLIGHT_ENABLE_LEVEL      1
        #define BACKLIGHT_DISABLE_LEVEL     0
    #elif defined (GFX_USE_DISPLAY_PANEL_TFT_800480_33_E)
        #define BACKLIGHT_ENABLE_LEVEL      0
        #define BACKLIGHT_DISABLE_LEVEL     1
    #elif defined (GFX_USE_DISPLAY_PANEL_TFT_640480_8_E)
        #define BACKLIGHT_ENABLE_LEVEL      0
        #define BACKLIGHT_DISABLE_LEVEL     1
    #elif defined (GFX_USE_DISPLAY_PANEL_35QVW0T)
        #define BACKLIGHT_ENABLE_LEVEL      0
        #define BACKLIGHT_DISABLE_LEVEL     1
    #else
        // default setting is logic low
        #define BACKLIGHT_ENABLE_LEVEL      0
        #define BACKLIGHT_DISABLE_LEVEL     1
    #endif

typedef enum
{
    ANSEL_DIGITAL = 0,
    ANSEL_ANALOG = 1
}ANSEL_BIT_STATE;


#if defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) || defined(GFX_PICTAIL_LCC)

    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        // When using the supported dsPIC and PIC24H devices

        // Definitions for reset pin
        #define DisplayResetConfig()        TRISAbits.TRISA4 = 0
        #define DisplayResetEnable()        LATAbits.LATA4 = 0
        #define DisplayResetDisable()       LATAbits.LATA4 = 1

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISAbits.TRISA1 = 0
        #define DisplaySetCommand()         LATAbits.LATA1 = 0
        #define DisplaySetData()            LATAbits.LATA1 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISBbits.TRISB15 = 0
        #define DisplayEnable()             LATBbits.LATB15 = 0
        #define DisplayDisable()            LATBbits.LATB15 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()
        #define DisplayFlashEnable()
        #define DisplayFlashDisable()

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()
        #define DisplayPowerOn()
        #define DisplayPowerOff()

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()
        #define DisplayBacklightOn()
        #define DisplayBacklightOff()


    #elif defined (__PIC32MX__)
        // When using the supported PIC32 devices

        /********
         * PIC32 will use the SET and CLR SFRs for the I/O.
         * These are atomic settings that are recommended when
         * modifying SFRs
         ********/
#if defined(__32MX250F128D__)

        #undef USE_8BIT_PMP      //no PMP selection on MX1xx/2xx devices, always in 8bit mode

        // Definitions for reset pin
        #define DisplayResetConfig()        TRISACLR = _TRISA_TRISA4_MASK
        #define DisplayResetEnable()        LATACLR = _LATA_LATA4_MASK
        #define DisplayResetDisable()       LATASET = _LATA_LATA4_MASK

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISBCLR = _TRISB_TRISB14_MASK
        #define DisplaySetCommand()         LATBCLR = _LATB_LATB14_MASK
        #define DisplaySetData()            LATBSET = _LATB_LATB14_MASK

        // Definitions for CS pin
        #define DisplayConfig()             TRISBCLR = _TRISB_TRISB15_MASK
        #define DisplayEnable()             LATBCLR = _LATB_LATB15_MASK
        #define DisplayDisable()            LATBSET = _LATB_LATB15_MASK

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()
        #define DisplayBacklightOn()
        #define DisplayBacklightOff()
#else
        // Definitions for reset pin
        #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK
        #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
        #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISBCLR = _TRISB_TRISB15_MASK
        #define DisplaySetCommand()         LATBCLR = _LATB_LATB15_MASK
        #define DisplaySetData()            LATBSET = _LATB_LATB15_MASK

        // Definitions for CS pin
        #define DisplayConfig()             TRISFCLR = _TRISF_TRISF12_MASK
        #define DisplayEnable()             LATFCLR = _LATF_LATF12_MASK
        #define DisplayDisable()            LATFSET = _LATF_LATF12_MASK

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISAbits.TRISA9 = 0)
        #define DisplayBacklightOn()        (LATAbits.LATA9 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATAbits.LATA9 = BACKLIGHT_DISABLE_LEVEL)
#endif
        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()
        #define DisplayFlashEnable()
        #define DisplayFlashDisable()

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()
        #define DisplayPowerOn()
        #define DisplayPowerOff()

    #elif defined (__PIC24F__) || defined (__dsPIC33E__) || defined (__PIC24E__)
        /* When using the supported PIC24F devices
            PIC24FJ128GA010
            PIC24FJ256GA110
            PIC24FJ256GB110
            PIC24FJ256GB210
           NOTE: PIC24FJ256DA210 is not on the list since
                 this part has a built in display controller
                 and it directly interfaces to the display
                 panel.
        */

        // Definitions for reset pin
        #define DisplayResetConfig()        TRISCbits.TRISC1 = 0
        #define DisplayResetEnable()        LATCbits.LATC1 = 0
        #define DisplayResetDisable()       LATCbits.LATC1 = 1

