fenogy/MedDispenser/Configs/HWP_MIKROMEDIA_PIC32.h
        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
        #define DisplaySetCommand()         LATCbits.LATC2 = 0
        #define DisplaySetData()            LATCbits.LATC2 = 1

        /*****
        * The MA330025-2 and MA240025-2 PIMs default to use RK12 for the
        * pin 70 of the 100 pin PIM header.
        *****/
        #if defined (__dsPIC33EP512MU814__) || defined (__PIC24EP512GU814__)
            // Definitions for CS pin
            #define DisplayConfig()             TRISKbits.TRISK12 = 0
            #define DisplayEnable()             LATKbits.LATK12 = 0
            #define DisplayDisable()            LATKbits.LATK12 = 1
        #else
            // Definitions for CS pin
            #define DisplayConfig()             TRISDbits.TRISD10 = 0
            #define DisplayEnable()             LATDbits.LATD10 = 0
            #define DisplayDisable()            LATDbits.LATD10 = 1
        #endif

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()
        #define DisplayFlashEnable()
        #define DisplayFlashDisable()

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()
        #define DisplayPowerOn()
        #define DisplayPowerOff()

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)


    #else

        #error "Selected PIC Device is not supported"

    #endif

// end of #if defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) || defined(GFX_PICTAIL_LCC)

// -----------------------------------
// When using MultiMedia Expansion Board
// -----------------------------------
/*
    This development board will be compatible with:
    1. PIC32 Starter Kits
       - PIC32 Starter Kit (DM320001)
       - PIC32 USB Starter Kit II (DM320003-2)
       - PIC32 Ethernet Starter Kit (DM320004)
*/

#elif defined (MEB_BOARD)

	#if defined(__dsPIC33E__) || defined(__PIC24E__)

		#define DisplayResetConfig()        ANSELAbits.ANSA10 = ANSEL_DIGITAL; TRISAbits.TRISA10 = 0
        #define DisplayResetEnable()        LATAbits.LATA10 = 0
        #define DisplayResetDisable()       LATAbits.LATA10 = 1

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      ANSELBbits.ANSB10 = ANSEL_DIGITAL; TRISBbits.TRISB10 = 0
        #define DisplaySetCommand()         LATBbits.LATB10 = 0
        #define DisplaySetData()            LATBbits.LATB10 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISGbits.TRISG13 = 0
        #define DisplayEnable()             LATGbits.LATG13 = 0
        #define DisplayDisable()            LATGbits.LATG13 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()
        #define DisplayFlashEnable()
        #define DisplayFlashDisable()

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()
        #define DisplayPowerOn()
        #define DisplayPowerOff()

         // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)

    #else
	     /********
	     * PIC32 will use the SET and CLR SFRs for the I/O.
	     * These are atomic settings that are recommended when
	     * modifying SFRs
	     ********/
	/*     // Definitions for reset pin
	     #define DisplayResetConfig()           TRISACLR = _TRISA_TRISA10_MASK
	     #define DisplayResetEnable()           LATACLR = _LATA_LATA10_MASK
	     #define DisplayResetDisable()          LATASET = _LATA_LATA10_MASK

	     // Definitions for RS pin
	     #define DisplayCmdDataConfig()         AD1PCFGSET = _AD1PCFG_PCFG10_MASK, TRISBCLR = _TRISB_TRISB10_MASK
	     #define DisplaySetCommand()            LATBCLR = _LATB_LATB10_MASK
	     #define DisplaySetData()               LATBSET = _LATB_LATB10_MASK

	     // Definitions for CS pin
	     #define DisplayConfig()                TRISGCLR = _TRISG_TRISG13_MASK
	     #define DisplayEnable()                LATGCLR = _LATG_LATG13_MASK
	     #define DisplayDisable()               LATGSET = _LATG_LATG13_MASK

		 */
	 // Definitions for reset pin
        #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK
        #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
        #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISBCLR = _TRISB_TRISB15_MASK
        #define DisplaySetCommand()         LATBCLR = _LATB_LATB15_MASK
        #define DisplaySetData()            LATBSET = _LATB_LATB15_MASK

        // Definitions for CS pin
        #define DisplayConfig()             TRISFCLR = _TRISF_TRISF12_MASK
        #define DisplayEnable()             LATFCLR = _LATF_LATF12_MASK
        #define DisplayDisable()            LATFSET = _LATF_LATF12_MASK

        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISAbits.TRISA9 = 0)
        #define DisplayBacklightOn()        (LATAbits.LATA9 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATAbits.LATA9 = BACKLIGHT_DISABLE_LEVEL)
	     // Definitions for FLASH CS pin
	     #define DisplayFlashConfig()
	     #define DisplayFlashEnable()
	     #define DisplayFlashDisable()

	     // Definitions for POWER ON pin
	     #define DisplayPowerConfig()
	     #define DisplayPowerOn()
	     #define DisplayPowerOff()
	/*
	    #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)
	    #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
	    #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)   */

	#endif

// end of #elif defined (MEB_BOARD)

